tests/load-testing/artillery-test.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  processor: "./artillery-processor.js"

scenarios:
  - name: "Complete User Journey"
    weight: 60
    flow:
      - get:
          url: "/health"
          capture:
            - json: "$.status"
              as: "health_status"

      - post:
          url: "/api/auth/google"
          json:
            code: "test-code"
          capture:
            - json: "$.data.accessToken"
              as: "token"

      - get:
          url: "/api/dashboard/overview"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode:
                - 200
                - 401

      - get:
          url: "/api/cards"
          headers:
            Authorization: "Bearer {{ token }}"

      - get:
          url: "/api/transactions?page=1&limit=20"
          headers:
            Authorization: "Bearer {{ token }}"

      - think: 3

  - name: "Dashboard Analytics"
    weight: 30
    flow:
      - get:
          url: "/api/analytics/summary"
          headers:
            Authorization: "Bearer mock-token"

      - get:
          url: "/api/analytics/spending-trends"
          headers:
            Authorization: "Bearer mock-token"

      - think: 2

  - name: "Transaction Management"
    weight: 10
    flow:
      - post:
          url: "/api/transactions"
          json:
            cardId: "{{ $randomUUID }}"
            amount: "{{ $randomNumber(10, 1000) }}"
            merchantName: "Test Merchant"
            transactionDate: "2024-11-04"
          headers:
            Authorization: "Bearer mock-token"

      - get:
          url: "/api/transactions"
          headers:
            Authorization: "Bearer mock-token"